samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
//*****************************************************************************
//
// enet_io.c - I/O control via a web server.
//
// Copyright (c) 2013-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.2.0.295 of the EK-TM4C1294XL Firmware Package.
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_nvic.h"
#include "inc/hw_types.h"
#include "driverlib/flash.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/timer.h"
#include "utils/locator.h"
#include "utils/lwiplib.h"
#include "third_party/lwip-1.4.1/src/include/lwip/netif.h"
#include "third_party/lwip-1.4.1/src/include/lwip/dhcp.h"
#include "third_party/lwip-1.4.1/src/include/netif/etharp.h"
#include "utils/uartstdio.h"
#include "utils/ustdlib.h"
#include "httpserver_raw/httpd.h"
#include "drivers/pinout.h"
#include "io.h"
#include "cgifuncs.h"
#include "config.h"
#include "mqtt_app.h"
#include "din_chain.h"
#include "relay_chain.h"
#include "input_events.h"
#include "relay_pulse.h"
#include "output_ctrl.h"
#include "sntp_client.h"
#include "ota.h"
#include "netbiosns.h"
#include "buildinfo.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>Ethernet-based I/O Control (enet_io)</h1>
//!
//! This example application demonstrates web-based I/O control using the
//! Tiva Ethernet controller and the lwIP TCP/IP Stack.  DHCP is used to
//! obtain an Ethernet address.  If DHCP times out without obtaining an
//! address, a static IP address will be chosen using AutoIP.  The address that
//! is selected will be shown on the UART allowing you to access the
//! internal web pages served by the application via your normal web browser.
//!
//! Two different methods of controlling board peripherals via web pages are
//! illustrated via pages labeled ``IO Control Demo 1'' and ``IO Control
//! Demo 2'' in the navigation menu on the left of the application's home page.
//! In both cases, the example allows you to toggle the state of the user LED
//! on the board and set the speed of a blinking LED.
//!
//! ``IO Control Demo 1'' uses JavaScript running in the web browser to send
//! HTTP requests for particular special URLs.  These special URLs are
//! intercepted in the file system support layer (io_fs.c) and used to
//! control the LED and animation LED.  Responses generated by the board are
//! returned to the browser and inserted into the page HTML dynamically by
//! more JavaScript code.
//!
//! ``IO Control Demo 2'' uses standard HTML forms to pass parameters to CGI
//! (Common Gateway Interface) handlers running on the board.  These handlers
//! process the form data and control the animation and LED as requested before
//! sending a response page (in this case, the original form) back to the
//! browser.  The application registers the names and handlers for each of its
//! CGIs with the HTTPD server during initialization and the server calls
//! these handlers after parsing URL parameters each time one of the CGI URLs
//! is requested.
//!
//! Information on the state of the various controls in the second demo is
//! inserted into the served HTML using SSI (Server Side Include) tags which
//! are parsed by the HTTPD server in the application.  As with the CGI
//! handlers, the application registers its list of SSI tags and a handler
//! function with the web server during initialization and this handler is
//! called whenever any registered tag is found in a .shtml, .ssi, .shtm or
//! .xml file being served to the browser.
//!
//! In addition to LED and animation speed control, the second example also
//! allows a line of text to be sent to the board for output to the UART.
//! This is included to illustrate the decoding of HTTP text strings.
//!
//! Note that the web server used by this example has been modified from the
//! example shipped with the basic lwIP package.  Additions include SSI and
//! CGI support along with the ability to have the server automatically insert
//! the HTTP headers rather than having these built in to the files in the
//! file system image.
//!
//! Source files for the internal file system image can be found in the ``fs''
//! directory.  If any of these files are changed, the file system image
//! (io_fsdata.h) should be rebuilt by running the following command from the
//! enet_io directory:
//!
//! ../../../../tools/bin/makefsfile -i fs -o io_fsdata.h -r -h -q
//!
//! For additional details on lwIP, refer to the lwIP web page at:
//! http://savannah.nongnu.org/projects/lwip/
//
//*****************************************************************************

//*****************************************************************************
//
// Defines for setting up the system clock.
//
//*****************************************************************************
#define SYSTICKHZ               100
#define SYSTICKMS               (1000 / SYSTICKHZ)

//*****************************************************************************
//
// Interrupt priority definitions.  The top 3 bits of these values are
// significant with lower values indicating higher priority interrupts.
//
//*****************************************************************************
#define SYSTICK_INT_PRIORITY    0x80
#define ETHERNET_INT_PRIORITY   0xC0

//*****************************************************************************
//
// A set of flags.  The flag bits are defined as follows:
//
//     0 -> An indicator that the animation timer interrupt has occurred.
//
//*****************************************************************************
#define FLAG_TICK            0
static volatile unsigned long g_ulFlags;

//*****************************************************************************
//
// External Application references.
//
//*****************************************************************************
extern void httpd_init(void);

//*****************************************************************************
//
// SSI tag indices for each entry in the g_pcSSITags array.
//
//*****************************************************************************
#define SSI_INDEX_HOST      0
#define SSI_INDEX_PORT      1
#define SSI_INDEX_CLIENT    2
#define SSI_INDEX_USER      3
#define SSI_INDEX_TOPIC     4
#define SSI_INDEX_AUTH      5
#define SSI_INDEX_STATUS    6
#define SSI_INDEX_IP        7
#define SSI_INDEX_DIN       8
#define SSI_INDEX_RELAY     9
#define SSI_INDEX_IOTYPES   10
#define SSI_INDEX_IOBINDS   11
#define SSI_INDEX_FWVER     12
#define SSI_INDEX_NTPTIME   13
#define SSI_INDEX_NTPSVR    14
#define SSI_INDEX_NTPTZ     15
#define SSI_INDEX_MQPASS    16
#define SSI_INDEX_INNAMES   17
#define SSI_INDEX_OUTNAMES  18
#define SSI_INDEX_INSTATES  19
#define SSI_INDEX_OUTSTATES 20
#define SSI_INDEX_OUTMODES  21
#define SSI_INDEX_OUTTMO    22
#define SSI_INDEX_SHUTTERS  23
#define SSI_INDEX_SHNAMES   24
#define SSI_INDEX_RMNAMES   25
#define SSI_INDEX_OUTROOMS  26
#define SSI_INDEX_SHROOMS   27

//*****************************************************************************
//
// This array holds all the strings that are to be recognized as SSI tag
// names by the HTTPD server.  The server will call SSIHandler to request a
// replacement string whenever the pattern <!--#tagname--> (where tagname
// appears in the following array) is found in ".ssi", ".shtml" or ".shtm"
// files that it serves.
//
//*****************************************************************************
static const char *g_pcConfigSSITags[] =
{
    "mqhost",        // SSI_INDEX_HOST
    "mqport",        // SSI_INDEX_PORT
    "mqclient",      // SSI_INDEX_CLIENT
    "mquser",        // SSI_INDEX_USER
    "mqtopic",       // SSI_INDEX_TOPIC
    "mqauth",        // SSI_INDEX_AUTH
    "mqstatus",      // SSI_INDEX_STATUS
    "ipaddr",        // SSI_INDEX_IP
    "mqdin",         // SSI_INDEX_DIN
    "mqrelay",       // SSI_INDEX_RELAY
    "iotypes",       // SSI_INDEX_IOTYPES
    "iobinds",       // SSI_INDEX_IOBINDS
    "fwver",         // SSI_INDEX_FWVER  — build timestamp YYYYMMDDHHMM
    "ntptime",       // SSI_INDEX_NTPTIME — current time HH:MM:SS
    "ntpsvr",        // SSI_INDEX_NTPSVR  — NTP server hostname
    "ntptz",         // SSI_INDEX_NTPTZ   — UTC offset (signed integer)
    "mqpass",        // SSI_INDEX_MQPASS  — MQTT password (for backup page)
    "innames",       // SSI_INDEX_INNAMES  — packed input names (12 B each, up to 64)
    "outnames",      // SSI_INDEX_OUTNAMES — packed output names (12 B each, up to 64)
    "instates",      // SSI_INDEX_INSTATES  — live input states as hex bytes
    "outstats",      // SSI_INDEX_OUTSTATES — live relay states as hex bytes (8-char limit)
    "outmodes",      // SSI_INDEX_OUTMODES  — per-output mode hex (1 char each, up to 16)
    "outtmo",        // SSI_INDEX_OUTTMO    — timed durations, comma list (up to 16)
    "shutters",      // SSI_INDEX_SHUTTERS  — packed "up:down:travel;" list
    "shnames",       // SSI_INDEX_SHNAMES   — packed shutter names (12 B each, up to 32)
    "rmnames",       // SSI_INDEX_RMNAMES   — packed room names (12 B each, 16 rooms)
    "outrooms",      // SSI_INDEX_OUTROOMS  — room index per output (comma list)
    "shrooms"        // SSI_INDEX_SHROOMS   — room index per defined shutter (comma list)
};

//*****************************************************************************
//
// The number of individual SSI tags that the HTTPD server can expect to
// find in our configuration pages.
//
//*****************************************************************************
#define NUM_CONFIG_SSI_TAGS     (sizeof(g_pcConfigSSITags) / sizeof (char *))

//*****************************************************************************
//
// Prototypes for the various CGI handler functions.
//
//*****************************************************************************
static char *MQTTConfigCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                  char *pcParam[], char *pcValue[]);
static char *IOConfigCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                char *pcParam[], char *pcValue[]);
static char *FwChunkCGIHandler(int32_t iIndex, int32_t i32NumParams,
                               char *pcParam[], char *pcValue[]);
static char *FactoryResetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                    char *pcParam[], char *pcValue[]);
static char *NtpCfgCGIHandler(int32_t iIndex, int32_t i32NumParams,
                               char *pcParam[], char *pcValue[]);
static char *CfgRestoreCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                  char *pcParam[], char *pcValue[]);
static char *RelayPulseCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                  char *pcParam[], char *pcValue[]);
static char *RebootCGIHandler(int32_t iIndex, int32_t i32NumParams,
                               char *pcParam[], char *pcValue[]);
static char *NameSetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                char *pcParam[], char *pcValue[]);
static char *OutCfgCGIHandler(int32_t iIndex, int32_t i32NumParams,
                               char *pcParam[], char *pcValue[]);
static char *CoverCGIHandler(int32_t iIndex, int32_t i32NumParams,
                              char *pcParam[], char *pcValue[]);
static char *RelaySetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                 char *pcParam[], char *pcValue[]);
static char *RoomCfgCGIHandler(int32_t iIndex, int32_t i32NumParams,
                                char *pcParam[], char *pcValue[]);

//*****************************************************************************
//
// Prototype for the main handler used to process server-side-includes for the
// application's web-based configuration screens.
//
//*****************************************************************************
static int32_t SSIHandler(int32_t iIndex, char *pcInsert, int32_t iInsertLen);

//*****************************************************************************
//
// CGI URI indices for each entry in the g_psConfigCGIURIs array.
//
//*****************************************************************************
#define CGI_INDEX_MQTTCFG       0
#define CGI_INDEX_IOCFG         1
#define CGI_INDEX_FWCHUNK       2
#define CGI_INDEX_FACTORYRESET  3
#define CGI_INDEX_NTPCFG        4
#define CGI_INDEX_CFGRESTORE    5
#define CGI_INDEX_RELAYPULSE    6
#define CGI_INDEX_REBOOT        7
#define CGI_INDEX_NAMESET       8
#define CGI_INDEX_OUTCFG        9
#define CGI_INDEX_COVER         10
#define CGI_INDEX_RELAYSET      11
#define CGI_INDEX_ROOMCFG       12

//*****************************************************************************
//
// This array is passed to the HTTPD server to inform it of special URIs
// that are treated as common gateway interface (CGI) scripts.  Each URI name
// is defined along with a pointer to the function which is to be called to
// process it.
//
//*****************************************************************************
static const tCGI g_psConfigCGIURIs[] =
{
    { "/mqttcfg.cgi",   (tCGIHandler)MQTTConfigCGIHandler }, // CGI_INDEX_MQTTCFG
    { "/iocfg.cgi",    (tCGIHandler)IOConfigCGIHandler   }, // CGI_INDEX_IOCFG
    { "/fwchunk.cgi",      (tCGIHandler)FwChunkCGIHandler      }, // CGI_INDEX_FWCHUNK
    { "/factoryreset.cgi",  (tCGIHandler)FactoryResetCGIHandler  }, // CGI_INDEX_FACTORYRESET
    { "/ntpcfg.cgi",       (tCGIHandler)NtpCfgCGIHandler        }, // CGI_INDEX_NTPCFG
    { "/cfgrestore.cgi",   (tCGIHandler)CfgRestoreCGIHandler     }, // CGI_INDEX_CFGRESTORE
    { "/relaypulse.cgi",  (tCGIHandler)RelayPulseCGIHandler     }, // CGI_INDEX_RELAYPULSE
    { "/reboot.cgi",      (tCGIHandler)RebootCGIHandler         }, // CGI_INDEX_REBOOT
    { "/nameset.cgi",     (tCGIHandler)NameSetCGIHandler        }, // CGI_INDEX_NAMESET
    { "/outcfg.cgi",      (tCGIHandler)OutCfgCGIHandler         }, // CGI_INDEX_OUTCFG
    { "/cover.cgi",       (tCGIHandler)CoverCGIHandler          }, // CGI_INDEX_COVER
    { "/relayset.cgi",    (tCGIHandler)RelaySetCGIHandler       }, // CGI_INDEX_RELAYSET
    { "/roomcfg.cgi",     (tCGIHandler)RoomCfgCGIHandler        }  // CGI_INDEX_ROOMCFG
};

//*****************************************************************************
//
// The number of individual CGI URIs that are configured for this system.
//
//*****************************************************************************
#define NUM_CONFIG_CGI_URIS     (sizeof(g_psConfigCGIURIs) / sizeof(tCGI))

//*****************************************************************************
//
// The file sent back to the browser by default following completion of any
// of our CGI handlers.  Each individual handler returns the URI of the page
// to load in response to it being called.
//
//*****************************************************************************
#define DEFAULT_CGI_RESPONSE    "/index.shtml"
#define IOCFG_CGI_RESPONSE      "/iocfg.shtml"
#define CONTROL_CGI_RESPONSE    "/control.shtml"

//*****************************************************************************
//
// The file sent back to the browser in cases where a parameter error is
// detected by one of the CGI handlers.  This should only happen if someone
// tries to access the CGI directly via the broswer command line and doesn't
// enter all the required parameters alongside the URI.
//
//*****************************************************************************
#define PARAM_ERROR_RESPONSE    "/perror.htm"

