samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
#define JAVASCRIPT_HEADER                                                     \
    "<script type='text/javascript' language='JavaScript'><!--\n"
#define JAVASCRIPT_FOOTER                                                     \
    "//--></script>\n"

//*****************************************************************************
//
// Timeout for DHCP address request (in seconds).
//
//*****************************************************************************
#ifndef DHCP_EXPIRE_TIMER_SECS
#define DHCP_EXPIRE_TIMER_SECS  45
#endif

//*****************************************************************************
//
// The current IP address.
//
//*****************************************************************************
uint32_t g_ui32IPAddress;

//*****************************************************************************
//
// MQTT IO integration state: a periodic tick flag set by SysTick, and a
// request flag asking the main loop to (re)start the MQTT connection (set
// when an IP is acquired or the configuration changes via the web UI).
//
//*****************************************************************************
static volatile bool g_bSysTickFlag;
static volatile bool g_bStartMQTT;
static volatile bool g_bRepublishMQTT;
static volatile bool g_bOTAReset;

//
// Live input state snapshot — updated every DINChainScan() tick so the
// SSI handler (runs in Ethernet ISR) can read it without touching hardware.
//
static uint8_t g_pui8LiveInState[DIN_MAX_BYTES];       // set by FwChunkCGIHandler on last chunk

//
// OTA upload state — written from the CGI handler (Ethernet ISR context).
//
static uint32_t g_ui32OTAWriteAddr;
static uint32_t g_ui32OTASize;
static uint8_t  g_ui8OTAAlignBuf[4];
static uint32_t g_ui32OTAAlignLen;
static uint32_t g_ui32OTALastErasedPage;
static bool     g_bOTAAbort;    // set on staging overflow — blocks the commit
static int32_t  g_i32OTANextSeq; // next chunk seq expected (idempotent retries)

//*****************************************************************************
//
// The system clock frequency.  Used by the SD card driver.
//
//*****************************************************************************
uint32_t g_ui32SysClock;

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

//*****************************************************************************
//
// Helper: copy a (possibly URL-encoded) CGI parameter into a fixed buffer.
//
//*****************************************************************************
static void
GetStringParam(const char *pcName, char *pcParam[], char *pcValue[],
               int32_t i32NumParams, char *pcDest, int32_t i32DestLen)
{
    int32_t i32Idx = FindCGIParameter(pcName, pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        DecodeFormString(pcValue[i32Idx], pcDest, i32DestLen);
    }
}

//*****************************************************************************
//
// CGI handler for /mqttcfg.cgi.  Parses the configuration form, stores the
// new settings in EEPROM and requests a reconnect.
//
//*****************************************************************************
static char *
MQTTConfigCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                     char *pcValue[])
{
    tMQTTConfig *psCfg = ConfigGet();
    int32_t i32Idx;

    (void)iIndex;

    //
    // String fields.  Empty values are accepted (e.g. to clear the host).
    //
    psCfg->pcHost[0] = '\0';
    GetStringParam("host", pcParam, pcValue, i32NumParams, psCfg->pcHost,
                   CFG_HOST_LEN);
    GetStringParam("client", pcParam, pcValue, i32NumParams, psCfg->pcClientID,
                   CFG_CLIENTID_LEN);
    GetStringParam("user", pcParam, pcValue, i32NumParams, psCfg->pcUser,
                   CFG_USER_LEN);
    GetStringParam("topic", pcParam, pcValue, i32NumParams, psCfg->pcTopicBase,
                   CFG_TOPIC_LEN);

    //
    // Password: only overwrite the stored value when a non-empty value is
    // submitted (the form never echoes the current password back).
    //
    i32Idx = FindCGIParameter("pass", pcParam, i32NumParams);
    if((i32Idx != -1) && (pcValue[i32Idx][0] != '\0'))
    {
        DecodeFormString(pcValue[i32Idx], psCfg->pcPass, CFG_PASS_LEN);
    }

    //
    // Port number.
    //
    i32Idx = FindCGIParameter("port", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        uint32_t ui32Port = ustrtoul(pcValue[i32Idx], 0, 10);
        psCfg->ui16Port = (ui32Port && (ui32Port <= 65535)) ?
                          (uint16_t)ui32Port : 1883;
    }

    //
    // Authentication checkbox (present in the form only when ticked).
    //
    psCfg->ui8UseAuth =
        (FindCGIParameter("auth", pcParam, i32NumParams) != -1) ? 1 : 0;

    //
    // Persist and ask the main loop to apply the new settings.
    //
    ConfigSave();
    g_bStartMQTT = true;

    return(DEFAULT_CGI_RESPONSE);
}

//*****************************************************************************
//
// Convert one ASCII hex character to its 4-bit value.
//
//*****************************************************************************
static uint8_t
HexNibble(char c)
{
    if((c >= '0') && (c <= '9'))
    {
        return((uint8_t)(c - '0'));
    }
    if((c >= 'a') && (c <= 'f'))
    {
        return((uint8_t)(c - 'a' + 10));
    }
    if((c >= 'A') && (c <= 'F'))
    {
        return((uint8_t)(c - 'A' + 10));
    }
    return(0);
}

//*****************************************************************************
//
// CGI handler for /iocfg.cgi.  Parses device counts and per-input type
// bitmask from the I/O configuration form, persists them to EEPROM and
// triggers a re-publish of HA discovery topics.
//
//*****************************************************************************
static char *
IOConfigCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                   char *pcValue[])
{
    int32_t i32Idx;

