samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    (void)iIndex;

    //
    // Device counts.
    //
    i32Idx = FindCGIParameter("din", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        ConfigSetDinDevices((uint8_t)ustrtoul(pcValue[i32Idx], 0, 10));
    }
    i32Idx = FindCGIParameter("relay", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        ConfigSetRelayDevices((uint8_t)ustrtoul(pcValue[i32Idx], 0, 10));
    }

    //
    // Per-input type bitmask ("types" = hex string, 2 chars per byte of 8
    // inputs; bit n of byte b = input b*8+n is pushbutton when set).
    //
    i32Idx = FindCGIParameter("types", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        const char *pcT = pcValue[i32Idx];
        int iByte = 0;
        while((pcT[0] != '\0') && (pcT[1] != '\0') && (iByte < 15))
        {
            uint8_t ui8Val = (uint8_t)((HexNibble(pcT[0]) << 4) |
                                       HexNibble(pcT[1]));
            int iBit;
            for(iBit = 0; iBit < 8; iBit++)
            {
                ConfigSetInputPushbutton(iByte * 8 + iBit,
                                        (ui8Val & (1u << iBit)) != 0);
            }
            pcT += 2;
            iByte++;
        }
    }

    //
    // Per-input binding table: "binds" = 3 hex chars per slot, 4 slots per
    // input, for up to D*8 inputs.  12-bit encoding: output[6:0]|act[4:3]|trig[2:0].
    // "000" = unused slot.  (Parsing also stops at the end of the sent string.)
    //
    i32Idx = FindCGIParameter("binds", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        const char *pcB = pcValue[i32Idx];
        int iLen = (int)strlen(pcB);
        int iMaxIn = (int)ConfigGetDinDevices() * 8;
        int iInput, iSlot, iPos = 0;
        if(iMaxIn > CFG_MAX_INPUTS) { iMaxIn = CFG_MAX_INPUTS; }
        for(iInput = 0; (iInput < iMaxIn) && ((iPos + 2) < iLen); iInput++)
        {
            for(iSlot = 0; (iSlot < CFG_BIND_SLOTS) &&
                           ((iPos + 2) < iLen); iSlot++, iPos += 3)
            {
                uint16_t ui16V = (uint16_t)(((uint16_t)HexNibble(pcB[iPos]) << 8) |
                                            ((uint16_t)HexNibble(pcB[iPos+1]) << 4) |
                                             (uint16_t)HexNibble(pcB[iPos+2]));
                uint8_t ui8TrigAct = (uint8_t)(ui16V & 0x1Fu);
                uint8_t ui8Out     = (uint8_t)((ui16V >> 5) & 0x7Fu);
                if((ui8TrigAct & 0x07u) == 0)
                {
                    ui8TrigAct = 0;
                    ui8Out = BIND_OUTPUT_NONE;
                }
                ConfigBindingSet(iInput, iSlot, ui8TrigAct, ui8Out);
            }
        }
    }

    //
    // Persist all three records and request chain + discovery update.
    //
    ConfigSave();
    ConfigIOSave();
    ConfigBindingSave();
    g_bStartMQTT = true;
    g_bRepublishMQTT = true;

    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// This function is called by the HTTP server whenever it encounters an SSI
// tag in a web page.  The iIndex parameter provides the index of the tag in
// the g_pcConfigSSITags array. This function writes the substitution text
// into the pcInsert array, writing no more than iInsertLen characters.
//
//*****************************************************************************
//*****************************************************************************
//
// FwChunkCGIHandler - Receives one hex-encoded binary chunk of an OTA image.
//
// URL format (GET):
//   /fwchunk.cgi?seq=N&last=0&data=HEXHEX...
//
// seq=0 initialises the upload and erases the header page + first image page.
// Each subsequent request appends to the staging flash.
// last=1 flushes the alignment buffer, computes CRC32, writes the OTA header
// and EEPROM flag, then schedules a system reset.
//
// The hex-encoded payload carries up to ~494 binary bytes per request
// (limited by LWIP_HTTPD_MAX_URI_LEN = 1024).
//
//*****************************************************************************
static char *
FwChunkCGIHandler(int32_t iIndex, int32_t i32NumParams,
                  char *pcParam[], char *pcValue[])
{
    int32_t  iSeqIdx, iLastIdx, iDataIdx;
    int32_t  iSeqNum;
    bool     bLast;
    const char *pcData;
    uint32_t ui32DataHexLen, i;
    uint32_t ui32PageAddr;
    tOTAHeader sHdr;
    uint32_t ui32Crc;

    iSeqIdx  = FindCGIParameter("seq",  pcParam, i32NumParams);
    iLastIdx = FindCGIParameter("last", pcParam, i32NumParams);
    iDataIdx = FindCGIParameter("data", pcParam, i32NumParams);

    if(iSeqIdx < 0 || iDataIdx < 0)
    {
        return(DEFAULT_CGI_RESPONSE);
    }

    iSeqNum = (int32_t)ustrtoul(pcValue[iSeqIdx], NULL, 10);
    bLast   = (iLastIdx >= 0) && (pcValue[iLastIdx][0] == '1');
    pcData  = pcValue[iDataIdx];
    ui32DataHexLen = ustrlen(pcData) & ~1u; // must be even (pairs of hex chars)

    //
    // First chunk: reset state and pre-erase the header and first image page.
    //
    if(iSeqNum == 0)
    {
        g_ui32OTAWriteAddr    = OTA_IMAGE_ADDR;
        g_ui32OTASize         = 0;
        g_ui32OTAAlignLen     = 0;
        g_ui32OTALastErasedPage = OTA_IMAGE_ADDR;
        g_bOTAAbort           = false;
        g_i32OTANextSeq       = 0;

        MAP_FlashErase(OTA_HEADER_ADDR);
        MAP_FlashErase(OTA_IMAGE_ADDR);

        UARTprintf("OTA: upload started.\n");
    }

    //
    // Once a chunk has overflowed the staging region (or otherwise failed),
    // ignore every further chunk until a fresh seq==0 restarts the upload.
    //
    if(g_bOTAAbort)
    {
        return("/tools.shtml");
    }

    //
    // Ordering / idempotency guard, so a dropped connection can be safely retried
    // by the client resending the SAME chunk.  Each seq is applied exactly once,
    // in order:
    //   seq <  next -> already applied (a retry whose response was lost) -> ACK
    //                  without re-writing, keeping the byte stream intact.
    //   seq >  next -> a chunk was missed -> abort; the client restarts at seq 0.
    //   seq == next -> apply it below, then advance g_i32OTANextSeq.
    //
    if(iSeqNum < g_i32OTANextSeq)
    {
        return(bLast ? "/fwupdate_ok.shtml" : "/tools.shtml");
    }
    if(iSeqNum > g_i32OTANextSeq)
    {
        g_bOTAAbort = true;
        UARTprintf("OTA: out-of-order chunk (got %d, want %d), aborting.\n",
                   iSeqNum, g_i32OTANextSeq);
        return("/tools.shtml");
    }

    //
    // Decode hex bytes and write to staging flash in 4-byte aligned words.
    //
    for(i = 0; i < ui32DataHexLen; i += 2)
    {
        g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] =
            (uint8_t)((HexNibble(pcData[i]) << 4) | HexNibble(pcData[i + 1]));
        g_ui32OTASize++;

        if(g_ui32OTAAlignLen == 4)
        {
            //
            // Never write past the end of the staging region.  A too-large image
            // (or a buggy/hostile client) would otherwise erase and program past
            // the OTA image slot into invalid flash.  Abort and block the commit.
            //
            if(g_ui32OTAWriteAddr >= OTA_IMAGE_ADDR + OTA_IMAGE_MAX_SIZE)
            {
                g_bOTAAbort       = true;
                g_ui32OTAAlignLen = 0;
                UARTprintf("OTA: image exceeds %u-byte staging region, aborting.\n",
                           (unsigned)OTA_IMAGE_MAX_SIZE);
                break;
            }

            //
            // Erase the next 16 KB page when the write pointer first enters it.
            //
            ui32PageAddr = g_ui32OTAWriteAddr & ~(0x4000u - 1u);
            if(ui32PageAddr > g_ui32OTALastErasedPage)
            {
                MAP_FlashErase(ui32PageAddr);
                g_ui32OTALastErasedPage = ui32PageAddr;
            }

            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }
    }

    //
    // Chunk fully applied — advance so a resend of this same seq is treated as a
    // duplicate ACK (idempotent retry) and the next seq is the one expected.
    //
    if(!g_bOTAAbort)
    {
        g_i32OTANextSeq++;
    }

    //
    // Last chunk: flush any partial word (pad with 0xFF), then finalise.
    //
    if(bLast)
    {
        int32_t  iTotLenIdx, iTotCrcIdx;
        uint32_t ui32TotLen, ui32TotCrc;

        //
        // If any chunk overflowed the staging region, never commit: no header is
        // written and no pending flag is set, so the next boot keeps the current
        // firmware.
        //
        if(g_bOTAAbort)
        {
            UARTprintf("OTA: upload aborted, not committing.\n");
            return("/tools.shtml");
        }

        if(g_ui32OTAAlignLen > 0)
        {
            while(g_ui32OTAAlignLen < 4)
            {
                g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] = 0xFF;
            }
            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }

        //
        // End-to-end integrity check.  The client sends the total byte count and
        // CRC32 of the ORIGINAL file (totlen/totcrc).  A truncated, reordered or
        // corrupted upload will not match, so it is rejected BEFORE the image is
        // committed.  Without this the header CRC is only computed over whatever
        // bytes happened to arrive, so a short upload looks self-consistent.
        //
        iTotLenIdx = FindCGIParameter("totlen", pcParam, i32NumParams);
        iTotCrcIdx = FindCGIParameter("totcrc", pcParam, i32NumParams);
        if(iTotLenIdx < 0 || iTotCrcIdx < 0)
        {
            UARTprintf("OTA: missing totlen/totcrc, rejecting.\n");
            return("/tools.shtml");
        }
        ui32TotLen = (uint32_t)ustrtoul(pcValue[iTotLenIdx], NULL, 10);
        ui32TotCrc = (uint32_t)ustrtoul(pcValue[iTotCrcIdx], NULL, 16);

        //
        // CRC32 the staged image (over exactly the received byte count).
        //
        ui32Crc = ConfigCRC32((const uint8_t *)OTA_IMAGE_ADDR, g_ui32OTASize);

