samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
        if((g_ui32OTASize != ui32TotLen) || (ui32Crc != ui32TotCrc))
        {
            UARTprintf("OTA: integrity check failed "
                       "(len %u/%u, crc 0x%08x/0x%08x), rejecting.\n",
                       g_ui32OTASize, ui32TotLen, ui32Crc, ui32TotCrc);
            return("/tools.shtml");
        }

        //
        // Verified.  Write the header to 0x80000 and arm the pending flag.
        //
        sHdr.ui32Magic = OTA_HDR_MAGIC;
        sHdr.ui32Size  = g_ui32OTASize;
        sHdr.ui32CRC32 = ui32Crc;
        sHdr.ui32Rsvd  = 0;
        MAP_FlashProgram((uint32_t *)(uintptr_t)&sHdr,
                         OTA_HEADER_ADDR, sizeof(tOTAHeader));

        //
        // Set EEPROM pending flag so the next boot applies the update.
        //
        OtaSetPending(g_ui32OTASize);

        UARTprintf("OTA: %u bytes, CRC=0x%08x verified. Rebooting...\n",
                   g_ui32OTASize, ui32Crc);

        //
        // Signal the main loop to reset after the HTTP response is sent.
        //
        g_bOTAReset = true;
        return("/fwupdate_ok.shtml");
    }

    return("/tools.shtml");
}

//*****************************************************************************
//
// FactoryResetCGIHandler - Web-triggered factory reset.
//
// Invalidates all EEPROM records, then schedules a system reset via the same
// g_bOTAReset flag used by the OTA handler so the HTTP response is sent first.
//
//*****************************************************************************
static char *
FactoryResetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                       char *pcParam[], char *pcValue[])
{
    UARTprintf("Factory reset triggered via web UI.\n");
    MQTTAppStop();
    ConfigFactoryReset();
    g_bOTAReset = true;
    return("/factoryreset_ok.shtml");
}

//*****************************************************************************
//
// RebootCGIHandler - Graceful reboot from the web UI.
//
//*****************************************************************************
static char *
RebootCGIHandler(int32_t iIndex, int32_t i32NumParams,
                 char *pcParam[], char *pcValue[])
{
    UARTprintf("Reboot triggered via web UI.\n");
    MQTTAppStop();
    g_bOTAReset = true;
    return("/fwupdate_ok.shtml");
}

//*****************************************************************************
//
// UrlDecodeParam - decode a CGI parameter value that may contain + (space)
// or %XX sequences produced by JS encodeURIComponent / form encoding.
//
//*****************************************************************************
static void
UrlDecodeParam(const char *pcIn, char *pcOut, int iMax)
{
    int iIn = 0, iOut = 0;
    while(pcIn[iIn] && iOut < iMax - 1)
    {
        if(pcIn[iIn] == '+')
        {
            pcOut[iOut++] = ' ';
            iIn++;
        }
        else if(pcIn[iIn] == '%' && pcIn[iIn + 1] && pcIn[iIn + 2])
        {
            pcOut[iOut++] = (char)((HexNibble(pcIn[iIn + 1]) << 4) |
                                    HexNibble(pcIn[iIn + 2]));
            iIn += 3;
        }
        else
        {
            pcOut[iOut++] = pcIn[iIn++];
        }
    }
    pcOut[iOut] = '\0';
}

//*****************************************************************************
//
// NameSetCGIHandler - save a custom name for one input or output channel.
//
// URL: /nameset.cgi?type=in|out&idx=N&name=<URL-encoded string, max 11 chars>
//
//*****************************************************************************
static char *
NameSetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                  char *pcParam[], char *pcValue[])
{
    int32_t iTypeIdx, iIdxIdx, iNameIdx;
    bool    bInput;
    int     iIdx;
    char    acName[CFG_NAME_LEN];

    iTypeIdx = FindCGIParameter("type", pcParam, i32NumParams);
    iIdxIdx  = FindCGIParameter("idx",  pcParam, i32NumParams);
    iNameIdx = FindCGIParameter("name", pcParam, i32NumParams);

    if(iTypeIdx < 0 || iIdxIdx < 0 || iNameIdx < 0)
    {
        return(IOCFG_CGI_RESPONSE);
    }

    bInput = (pcValue[iTypeIdx][0] == 'i');
    iIdx   = (int)ustrtoul(pcValue[iIdxIdx], NULL, 10);
    UrlDecodeParam(pcValue[iNameIdx], acName, CFG_NAME_LEN);
    ConfigNameSet(bInput, iIdx, acName);
    UARTprintf("Name: %s[%d] = \"%s\"\n", bInput ? "in" : "out", iIdx, acName);
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// CheckHWFactoryReset - Check SW1 (PJ0) at startup.
//
// If SW1 is held continuously for 5 seconds, all EEPROM records are
// invalidated and the device resets.  LED D1 (PN1) blinks as a countdown
// indicator.  Releasing SW1 at any point cancels the operation.
//
// Call after ConfigInit() (EEPROM must be initialised) but before the
// network stack starts.
//
//*****************************************************************************
static void
CheckHWFactoryReset(void)
{
    uint32_t ui32Count;

    //
    // Enable the GPIO ports used by SW1 (Port J) and LED D1 (Port N).
    // PinoutSet() may already have done this, but enabling twice is harmless.
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOJ) ||
          !MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPION))
    {
    }

    //
    // PJ0 input with weak pull-up (SW1 is active-low).
    //
    MAP_GPIODirModeSet(GPIO_PORTJ_BASE, GPIO_PIN_0, GPIO_DIR_MODE_IN);
    MAP_GPIOPadConfigSet(GPIO_PORTJ_BASE, GPIO_PIN_0,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);

    //
    // PN1 output for LED D1 (active-high, off initially).
    //
    MAP_GPIODirModeSet(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_DIR_MODE_OUT);
    MAP_GPIOPadConfigSet(GPIO_PORTN_BASE, GPIO_PIN_1,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD);
    MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0);

    //
    // Quick exit if SW1 is not held at boot.
    //
    if(MAP_GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_0) != 0)
    {
        return;
    }

    UARTprintf("HW factory reset: keep SW1 held for 5s to confirm...\n");

    //
    // 500 x 10ms = 5 000ms countdown.  LED blinks every 500ms.
    //
    for(ui32Count = 0; ui32Count < 500; ui32Count++)
    {
        //
        // Toggle LED every 50 iterations (~500ms period).
        //
        MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1,
                         ((ui32Count / 50) & 1) ? GPIO_PIN_1 : 0);

        MAP_SysCtlDelay(g_ui32SysClock / 300);   // ~10 ms at 120 MHz

        if(MAP_GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_0) != 0)
        {
            MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0);
            UARTprintf("HW factory reset: cancelled (SW1 released).\n");
            return;
        }
    }

    //
    // SW1 held for 5 seconds — perform factory reset.
    //
    MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_PIN_1); // LED on solid
    UARTprintf("HW factory reset: erasing EEPROM...\n");
    MQTTAppStop();
    ConfigFactoryReset();
    UARTprintf("HW factory reset: rebooting...\n");
    MAP_SysCtlDelay(g_ui32SysClock / 3);
    MAP_SysCtlReset();
}

//*****************************************************************************
//
// NtpCfgCGIHandler - Save NTP server + TZ offset then restart SNTP.
//
//*****************************************************************************
static char *
NtpCfgCGIHandler(int32_t iIndex, int32_t i32NumParams,
                 char *pcParam[], char *pcValue[])
{
    int32_t iIdx;
    char    acServer[CFG_NTP_SERVER_LEN];
    int32_t i32Tz = 0;

    iIdx = FindCGIParameter("ntp", pcParam, i32NumParams);
    if(iIdx >= 0)
    {
        GetStringParam("ntp", pcParam, pcValue, i32NumParams,
                       acServer, CFG_NTP_SERVER_LEN);
        ConfigNtpSetServer(acServer);
    }

