samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    iIdx = FindCGIParameter("tz", pcParam, i32NumParams);
    if(iIdx >= 0)
    {
        i32Tz = (int32_t)ustrtoul(pcValue[iIdx], NULL, 10);
        if(pcValue[iIdx][0] == '-') { i32Tz = -i32Tz; }
        if(i32Tz < -12) { i32Tz = -12; }
        if(i32Tz >  14) { i32Tz =  14; }
        ConfigNtpSetTz((int8_t)i32Tz);
    }

    ConfigNtpSave();
    SntpInit();
    UARTprintf("NTP: config updated, re-syncing.\n");
    return(DEFAULT_CGI_RESPONSE);
}

//*****************************************************************************
//
// CfgRestoreCGIHandler - Restore broker + NTP config from a JSON chunk stream.
//
// URL: /cfgrestore.cgi?seq=N&last=0|1&data=HEXHEX...
//
// Hex-decoded bytes accumulate in g_acCfgRestoreBuf.  On last=1 the buffer
// is parsed as JSON and the broker + NTP EEPROM records are updated.
//
//*****************************************************************************
#define CFG_RESTORE_BUF_SIZE 2048

static char    g_acCfgRestoreBuf[CFG_RESTORE_BUF_SIZE];
static uint32_t g_ui32CfgRestoreLen = 0;

//
// Minimal JSON value extractor using strstr.
//
// Skip JSON whitespace (space, tab, CR, LF).
#define SKIP_WS(p) while(*(p)==' '||*(p)=='\t'||*(p)=='\r'||*(p)=='\n'){(p)++;}

static bool
CfgJsonGetStr(const char *pcJson, const char *pcKey,
              char *pcVal, int iMax)
{
    char acSearch[48];
    const char *p;
    int i = 0;
    // Search for "key": — no trailing quote so it matches both "k":"v" and "k": "v"
    usnprintf(acSearch, sizeof(acSearch), "\"%s\":", pcKey);
    p = strstr(pcJson, acSearch);
    if(!p) { return(false); }
    p += ustrlen(acSearch);
    SKIP_WS(p);
    if(*p != '"') { return(false); }
    p++;  // skip opening quote
    while(*p && *p != '"' && i < iMax - 1) { pcVal[i++] = *p++; }
    pcVal[i] = '\0';
    return(true);
}

static int32_t
CfgJsonGetInt(const char *pcJson, const char *pcKey)
{
    char acSearch[48];
    const char *p;
    usnprintf(acSearch, sizeof(acSearch), "\"%s\":", pcKey);
    p = strstr(pcJson, acSearch);
    if(!p) { return(-1); }
    p += ustrlen(acSearch);
    SKIP_WS(p);
    if(*p == '-') { return(-(int32_t)ustrtoul(p + 1, NULL, 10)); }
    return((int32_t)ustrtoul(p, NULL, 10));
}

static char *
CfgRestoreCGIHandler(int32_t iIndex, int32_t i32NumParams,
                     char *pcParam[], char *pcValue[])
{
    int32_t iSeqIdx, iLastIdx, iDataIdx;
    bool    bLast;
    const char *pcData;
    uint32_t ui32DataHexLen, i;

    iSeqIdx  = FindCGIParameter("seq",  pcParam, i32NumParams);
    iLastIdx = FindCGIParameter("last", pcParam, i32NumParams);
    iDataIdx = FindCGIParameter("data", pcParam, i32NumParams);

    if(iSeqIdx < 0 || iDataIdx < 0) { return(DEFAULT_CGI_RESPONSE); }

    bLast  = (iLastIdx >= 0) && (pcValue[iLastIdx][0] == '1');
    pcData = pcValue[iDataIdx];
    ui32DataHexLen = ustrlen(pcData) & ~1u;

    if(ustrtoul(pcValue[iSeqIdx], NULL, 10) == 0)
    {
        g_ui32CfgRestoreLen = 0;
    }

    for(i = 0; i < ui32DataHexLen && g_ui32CfgRestoreLen < CFG_RESTORE_BUF_SIZE - 1u; i += 2)
    {
        g_acCfgRestoreBuf[g_ui32CfgRestoreLen++] =
            (char)((HexNibble(pcData[i]) << 4) | HexNibble(pcData[i + 1]));
    }

    if(!bLast) { return(DEFAULT_CGI_RESPONSE); }

    g_acCfgRestoreBuf[g_ui32CfgRestoreLen] = '\0';
    UARTprintf("CfgRestore: %u bytes JSON received.\n", g_ui32CfgRestoreLen);

    //
    // Parse and apply broker config.
    //
    {
        tMQTTConfig *psCfg = ConfigGet();
        char        acTmp[64];
        int32_t     i32Val;

        if(CfgJsonGetStr(g_acCfgRestoreBuf, "host", acTmp, CFG_HOST_LEN))
        { ustrncpy(psCfg->pcHost, acTmp, CFG_HOST_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "client", acTmp, CFG_CLIENTID_LEN))
        { ustrncpy(psCfg->pcClientID, acTmp, CFG_CLIENTID_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "user", acTmp, CFG_USER_LEN))
        { ustrncpy(psCfg->pcUser, acTmp, CFG_USER_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "pass", acTmp, CFG_PASS_LEN))
        { ustrncpy(psCfg->pcPass, acTmp, CFG_PASS_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "topic", acTmp, CFG_TOPIC_LEN))
        { ustrncpy(psCfg->pcTopicBase, acTmp, CFG_TOPIC_LEN - 1); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "port");
        if(i32Val > 0 && i32Val <= 65535) { psCfg->ui16Port = (uint16_t)i32Val; }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "auth");
        if(i32Val >= 0) { psCfg->ui8UseAuth = (uint8_t)(i32Val != 0); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "din");
        if(i32Val >= 0) { ConfigSetDinDevices((uint8_t)i32Val); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "relay");
        if(i32Val >= 0) { ConfigSetRelayDevices((uint8_t)i32Val); }
        ConfigSave();
    }

    //
    // Parse and apply NTP config.
    //
    {
        char    acTmp[CFG_NTP_SERVER_LEN];
        int32_t i32Val;
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "ntp", acTmp, CFG_NTP_SERVER_LEN))
        { ConfigNtpSetServer(acTmp); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "tz");
        if(i32Val >= -12 && i32Val <= 14) { ConfigNtpSetTz((int8_t)i32Val); }
        ConfigNtpSave();
    }

    //
    // Restore per-input types (Switch / Pushbutton) from hex string.
    // Format: 2 hex chars per SN65HVS882 device (1 bit per input channel).
    //
    {
        char acTypes[64];
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "types", acTypes, sizeof(acTypes)))
        {
            const char *p = acTypes;
            int b, bit;
            for(b = 0; b < CFG_DIN_MAX_DEVICES && p[0] && p[1]; b++, p += 2)
            {
                uint8_t ui8Val = (uint8_t)((HexNibble(p[0]) << 4) |
                                            HexNibble(p[1]));
                for(bit = 0; bit < 8; bit++)
                {
                    ConfigSetInputPushbutton(b * 8 + bit,
                                             (ui8Val >> bit) & 1 ? true : false);
                }
            }
            ConfigIOSave();
            UARTprintf("CfgRestore: input types restored.\n");
        }
    }

    //
    // Restore input-to-relay bindings from hex string.
    // Format: 3 hex chars per slot, 4 slots per input, up to 16 inputs.
    // Encoding: bits 11:5 = output, bits 4:3 = action, bits 2:0 = trigger.
    //
    {
        char acBinds[256];
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "binds", acBinds, sizeof(acBinds)))
        {
            const char *p    = acBinds;
            int         iLen = (int)ustrlen(acBinds);
            int         iIn, iSlot;
            int         iMaxIn = (int)ConfigGetDinDevices() * 8;
            if(iMaxIn > 16) { iMaxIn = 16; }
            for(iIn = 0; iIn < iMaxIn; iIn++)
            {
                for(iSlot = 0; iSlot < CFG_BIND_SLOTS; iSlot++)
                {
                    uint16_t v;
                    uint8_t  ui8TrigAct, ui8Out;
                    if((p - acBinds) + 3 > iLen) { goto done_binds; }
                    v = (uint16_t)(((uint16_t)HexNibble(p[0]) << 8) |
                                   ((uint16_t)HexNibble(p[1]) << 4) |
                                    (uint16_t)HexNibble(p[2]));
                    p += 3;
                    //
                    // Low 5 bits of v encode trig (2:0) and act (4:3),
                    // matching the ui8TrigAct field layout in tIOBindings.
                    //
                    ui8TrigAct = (uint8_t)(v & 0x1Fu);
                    ui8Out = ((v & 7u) == 0) ? BIND_OUTPUT_NONE
                                              : (uint8_t)((v >> 5) & 0x7Fu);
                    ConfigBindingSet(iIn, iSlot, ui8TrigAct, ui8Out);
                }
            }
            done_binds:
            ConfigBindingSave();
            UARTprintf("CfgRestore: bindings restored.\n");
        }
    }

    //
    // Restore channel names from packed 12-char-per-slot strings.
    // Trailing spaces are stripped; empty names are skipped (keep existing).
    //
    {
        char acPacked[256];
        int  iMax, i;

