samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "innames", acPacked, sizeof(acPacked)))
        {
            iMax = (int)ConfigGetDinDevices() * 8;
            if(iMax > CFG_NAMES_MAX_INPUTS) { iMax = CFG_NAMES_MAX_INPUTS; }
            for(i = 0; i < iMax && (i + 1) * CFG_NAME_LEN <= (int)ustrlen(acPacked); i++)
            {
                char acName[CFG_NAME_LEN];
                int  k = CFG_NAME_LEN - 2;
                memcpy(acName, acPacked + i * CFG_NAME_LEN, CFG_NAME_LEN - 1);
                acName[CFG_NAME_LEN - 1] = '\0';
                while(k >= 0 && acName[k] == ' ') { acName[k--] = '\0'; }
                if(acName[0]) { ConfigNameSet(true, i, acName); }
            }
            UARTprintf("CfgRestore: input names restored.\n");
        }

        if(CfgJsonGetStr(g_acCfgRestoreBuf, "outnames", acPacked, sizeof(acPacked)))
        {
            iMax = (int)ConfigGetRelayDevices() * 8;
            if(iMax > CFG_NAMES_MAX_OUTPUTS) { iMax = CFG_NAMES_MAX_OUTPUTS; }
            for(i = 0; i < iMax && (i + 1) * CFG_NAME_LEN <= (int)ustrlen(acPacked); i++)
            {
                char acName[CFG_NAME_LEN];
                int  k = CFG_NAME_LEN - 2;
                memcpy(acName, acPacked + i * CFG_NAME_LEN, CFG_NAME_LEN - 1);
                acName[CFG_NAME_LEN - 1] = '\0';
                while(k >= 0 && acName[k] == ' ') { acName[k--] = '\0'; }
                if(acName[0]) { ConfigNameSet(false, i, acName); }
            }
            UARTprintf("CfgRestore: output names restored.\n");
        }
    }

    UARTprintf("CfgRestore: settings applied. Rebooting...\n");
    g_bOTAReset = true;
    return("/cfgrestore_ok.shtml");
}

//*****************************************************************************
//
// RelayPulseCGIHandler - Trigger a timed relay pulse from the web UI.
//
// URL: /relaypulse.cgi?relay=N&ms=D
//   relay = 0-based relay index
//   ms    = pulse duration in milliseconds (1..3 600 000)
//
//*****************************************************************************
static char *
RelayPulseCGIHandler(int32_t iIndex, int32_t i32NumParams,
                     char *pcParam[], char *pcValue[])
{
    int32_t  iRelayIdx, iMsIdx;
    uint32_t ui32Relay, ui32Ms;

    iRelayIdx = FindCGIParameter("relay", pcParam, i32NumParams);
    iMsIdx    = FindCGIParameter("ms",    pcParam, i32NumParams);

    if(iRelayIdx < 0)
    {
        return(IOCFG_CGI_RESPONSE);
    }

    ui32Relay = ustrtoul(pcValue[iRelayIdx], NULL, 10);
    ui32Ms    = (iMsIdx >= 0) ? ustrtoul(pcValue[iMsIdx], NULL, 10) : 0;

    if(ui32Ms == 0)
    {
        ui32Ms = 1000;   // implicit default: missing/0 duration pulses for 1 s
    }

    if(ui32Ms > 3600000u || ui32Relay >= (uint32_t)RelayChainCount())
    {
        return(IOCFG_CGI_RESPONSE);
    }

    UARTprintf("Pulse: relay %u for %u ms (web UI)\n", ui32Relay, ui32Ms);
    RelayPulseStart((int)ui32Relay, ui32Ms);
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// OutCfgCGIHandler - Save per-output modes, timed durations, and the shutter
// table.  Query parameters (all optional):
//   modes = one char per output, '1' = Timed, else Standard.
//   tmo   = comma-separated timed auto-OFF durations (ms), one per output.
//   sh    = "up:down:travel;up:down:travel;..." shutter definitions (rebuilds
//           the whole table; invalid pairs are skipped).
//
//*****************************************************************************
static char *
OutCfgCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                 char *pcValue[])
{
    int32_t idx;
    int     i, iSlot;

    (void)iIndex;

    //
    // Per-output mode.
    //
    idx = FindCGIParameter("modes", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        for(i = 0; (p[i] != '\0') && (i < CFG_MAX_OUTPUTS); i++)
        {
            ConfigSetOutMode(i, (p[i] == '1') ? OUT_MODE_TIMED
                                              : OUT_MODE_STANDARD);
        }
    }

    //
    // Per-output timed auto-OFF durations.
    //
    idx = FindCGIParameter("tmo", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        i = 0;
        while((*p != '\0') && (i < CFG_MAX_OUTPUTS))
        {
            uint32_t v = 0;
            while((*p >= '0') && (*p <= '9')) { v = (v * 10u) + (uint32_t)(*p - '0'); p++; }
            ConfigSetOutTimedMs(i, v ? v : 1000u);
            i++;
            if(*p == ',') { p++; } else { break; }
        }
    }

    //
    // Shutter table — always rebuilt from scratch.
    //
    for(iSlot = 0; iSlot < CFG_MAX_SHUTTERS; iSlot++)
    {
        ConfigShutterClear(iSlot);
    }
    idx = FindCGIParameter("sh", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        iSlot = 0;
        while((*p != '\0') && (iSlot < CFG_MAX_SHUTTERS))
        {
            uint32_t up = 0, down = 0, travel = 0;
            char     acName[CFG_NAME_LEN];
            acName[0] = '\0';
            while((*p >= '0') && (*p <= '9')) { up = (up * 10u) + (uint32_t)(*p - '0'); p++; }
            if(*p != ':') { break; }
            p++;
            while((*p >= '0') && (*p <= '9')) { down = (down * 10u) + (uint32_t)(*p - '0'); p++; }
            if(*p != ':') { break; }
            p++;
            while((*p >= '0') && (*p <= '9')) { travel = (travel * 10u) + (uint32_t)(*p - '0'); p++; }

            //
            // Optional 4th field ":name" (URL-encoded, runs to ';' or end).
            //
            if(*p == ':')
            {
                char acEnc[3 * CFG_NAME_LEN];
                int  iEnc = 0;
                p++;
                while((*p != '\0') && (*p != ';'))
                {
                    if(iEnc < (int)sizeof(acEnc) - 1) { acEnc[iEnc++] = *p; }
                    p++;
                }
                acEnc[iEnc] = '\0';
                UrlDecodeParam(acEnc, acName, CFG_NAME_LEN);
            }

            if((up != down) && (up < RelayChainCount()) && (down < RelayChainCount()))
            {
                ConfigShutterSet(iSlot, (uint8_t)up, (uint8_t)down,
                                 travel ? travel : 20000u);
                ConfigShutterNameSet(iSlot, acName);
                iSlot++;
            }
            if(*p == ';') { p++; } else { break; }
        }
    }

    ConfigOutputSave();
    OutputCtrlReload();
    g_bRepublishMQTT = true;   // refresh HA discovery (covers vs switches)
    UARTprintf("Output config saved via web UI.\n");
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// CoverCGIHandler - Web UP/DOWN/STOP buttons for a shutter.
//   /cover.cgi?sh=N&cmd=up|down|stop
//
//*****************************************************************************
static char *
CoverCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                char *pcValue[])
{
    int32_t  iShIdx, iCmdIdx;
    uint32_t ui32Sh;
    tShCmd   eCmd;

