samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    (void)iIndex;

    iShIdx  = FindCGIParameter("sh",  pcParam, i32NumParams);
    iCmdIdx = FindCGIParameter("cmd", pcParam, i32NumParams);
    if((iShIdx < 0) || (iCmdIdx < 0))
    {
        return(IOCFG_CGI_RESPONSE);
    }

    ui32Sh = ustrtoul(pcValue[iShIdx], NULL, 10);
    switch(pcValue[iCmdIdx][0])
    {
        case 'u': eCmd = SH_CMD_UP;     break;   // momentary: idle→open, moving→stop
        case 'd': eCmd = SH_CMD_DOWN;   break;   // momentary: idle→close, moving→stop
        case 's': eCmd = SH_CMD_STOP;   break;
        case 'c': eCmd = SH_CMD_TOGGLE; break;   // single-button cycle
        default:  return(IOCFG_CGI_RESPONSE);
    }

    UARTprintf("Cover: shutter %u cmd %d (web UI)\n", ui32Sh, (int)eCmd);
    OutputCtrlShutter((int)ui32Sh, eCmd);
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// RelaySetCGIHandler - direct ON/OFF/Toggle for a light (Control dashboard).
//   /relayset.cgi?relay=N&cmd=on|off|toggle
// Routed through OutputCtrlCommand so the output's mode (Standard/Timed) and
// any shutter-member translation are honored, and the state is published.
//
//*****************************************************************************
static char *
RelaySetCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                   char *pcValue[])
{
    int32_t  iRelIdx, iCmdIdx;
    uint32_t ui32Relay;
    tOutCmd  eCmd;

    (void)iIndex;

    iRelIdx = FindCGIParameter("relay", pcParam, i32NumParams);
    iCmdIdx = FindCGIParameter("cmd",   pcParam, i32NumParams);
    if((iRelIdx < 0) || (iCmdIdx < 0))
    {
        return(CONTROL_CGI_RESPONSE);
    }

    ui32Relay = ustrtoul(pcValue[iRelIdx], NULL, 10);
    if(ui32Relay >= RelayChainCount())
    {
        return(CONTROL_CGI_RESPONSE);
    }

    //
    // cmd = "on" | "off" | "toggle".  "on"/"off" share a first char, so
    // disambiguate on the second; anything else is a toggle.
    //
    if(pcValue[iCmdIdx][0] == 'o')
    {
        eCmd = (pcValue[iCmdIdx][1] == 'n') ? OUT_CMD_ON : OUT_CMD_OFF;
    }
    else
    {
        eCmd = OUT_CMD_TOGGLE;
    }

    UARTprintf("RelaySet: relay %u cmd %d (web UI)\n", ui32Relay, (int)eCmd);
    OutputCtrlCommand((int)ui32Relay, eCmd);
    return(CONTROL_CGI_RESPONSE);
}

//*****************************************************************************
//
// RoomCfgCGIHandler - save room names + per-output/per-shutter room assignment.
//   /roomcfg.cgi?rooms=<;-sep URL-encoded names>&outr=<csv>&shr=<csv>
// "255" (or any value >= CFG_MAX_ROOMS) means unassigned.
//
//*****************************************************************************
static char *
RoomCfgCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                  char *pcValue[])
{
    int32_t idx;
    int     i;

    (void)iIndex;

    //
    // Room names: ';'-separated, each URL-encoded (so ';'/'&' cannot appear
    // literally inside a name), index 0..CFG_MAX_ROOMS-1.
    //
    idx = FindCGIParameter("rooms", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        int iRoom = 0;
        while(iRoom < CFG_MAX_ROOMS)
        {
            char acEnc[3 * CFG_NAME_LEN];
            char acName[CFG_NAME_LEN];
            int  iEnc = 0;
            while((*p != '\0') && (*p != ';'))
            {
                if(iEnc < (int)sizeof(acEnc) - 1) { acEnc[iEnc++] = *p; }
                p++;
            }
            acEnc[iEnc] = '\0';
            UrlDecodeParam(acEnc, acName, CFG_NAME_LEN);
            ConfigRoomNameSet(iRoom, acName);
            iRoom++;
            if(*p == ';') { p++; } else { break; }
        }
        for(; iRoom < CFG_MAX_ROOMS; iRoom++) { ConfigRoomNameSet(iRoom, ""); }
    }

    //
    // Per-output room index (comma list, one per output).
    //
    idx = FindCGIParameter("outr", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        i = 0;
        while((*p != '\0') && (i < CFG_MAX_OUTPUTS))
        {
            uint32_t v = 0;
            while((*p >= '0') && (*p <= '9')) { v = (v * 10u) + (uint32_t)(*p - '0'); p++; }
            ConfigOutRoomSet(i, (v < CFG_MAX_ROOMS) ? (uint8_t)v : ROOM_NONE);
            i++;
            if(*p == ',') { p++; } else { break; }
        }
    }

    //
    // Per-shutter room index (comma list, defined shutters in slot order).
    //
    idx = FindCGIParameter("shr", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        i = 0;
        while((*p != '\0') && (i < CFG_MAX_SHUTTERS))
        {
            uint32_t v = 0;
            while((*p >= '0') && (*p <= '9')) { v = (v * 10u) + (uint32_t)(*p - '0'); p++; }
            ConfigShRoomSet(i, (v < CFG_MAX_ROOMS) ? (uint8_t)v : ROOM_NONE);
            i++;
            if(*p == ',') { p++; } else { break; }
        }
    }

    ConfigRoomSave();
    UARTprintf("Room config saved via web UI.\n");
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
static int32_t
SSIHandler(int32_t iIndex, char *pcInsert, int32_t iInsertLen)
{
    tMQTTConfig *psCfg = ConfigGet();

    //
    // Which SSI tag have we been passed?  (The password is intentionally never
    // echoed back to the browser.)
    //
    switch(iIndex)
    {
        case SSI_INDEX_HOST:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcHost);
            break;

        case SSI_INDEX_PORT:
            usnprintf(pcInsert, iInsertLen, "%d", psCfg->ui16Port);
            break;

        case SSI_INDEX_CLIENT:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcClientID);
            break;

        case SSI_INDEX_USER:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcUser);
            break;

        case SSI_INDEX_TOPIC:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcTopicBase);
            break;

        case SSI_INDEX_DIN:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetDinDevices());
            break;

        case SSI_INDEX_RELAY:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetRelayDevices());
            break;

        case SSI_INDEX_AUTH:
            usnprintf(pcInsert, iInsertLen, "%s",
                      psCfg->ui8UseAuth ? "checked" : "");
            break;

