samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
        case SSI_INDEX_STATUS:
            usnprintf(pcInsert, iInsertLen, "%s", MQTTAppStatusStr());
            break;

        case SSI_INDEX_IP:
            usnprintf(pcInsert, iInsertLen, "%d.%d.%d.%d",
                      g_ui32IPAddress & 0xff, (g_ui32IPAddress >> 8) & 0xff,
                      (g_ui32IPAddress >> 16) & 0xff,
                      (g_ui32IPAddress >> 24) & 0xff);
            break;

        case SSI_INDEX_IOTYPES:
        {
            //
            // Emit one byte (2 hex chars) per DIN device, LSB = input 0 of
            // that device.  The I/O config page uses this to seed each select.
            //
            static const char pcHex[] = "0123456789abcdef";
            int iDin = (int)ConfigGetDinDevices();
            int iByte, iBit;
            int iPos = 0;
            for(iByte = 0; (iByte < iDin) && ((iPos + 2) < iInsertLen);
                iByte++)
            {
                uint8_t ui8Val = 0;
                for(iBit = 0; iBit < 8; iBit++)
                {
                    if(ConfigInputIsPushbutton(iByte * 8 + iBit))
                    {
                        ui8Val |= (uint8_t)(1u << iBit);
                    }
                }
                pcInsert[iPos++] = pcHex[(ui8Val >> 4) & 0xF];
                pcInsert[iPos++] = pcHex[ui8Val & 0xF];
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_IOBINDS:
        {
            //
            // Emit up to D*8 inputs x 4 slots x 3 hex chars (12 B/input).  The
            // loop guard below caps it at the SSI insert buffer
            // (LWIP_HTTPD_MAX_TAG_INSERT_LEN, 800 B = 66 inputs).  Per slot:
            // 12-bit value = (output<<5)|(action<<3)|trigger as "XYZ";
            // "000" = unused slot.
            //
            static const char pcHexB[] = "0123456789abcdef";
            int iDin = (int)ConfigGetDinDevices();
            int iMaxIn = iDin * 8;
            int iInput, iSlot, iPos = 0;
            if(iMaxIn > CFG_MAX_INPUTS) { iMaxIn = CFG_MAX_INPUTS; }
            for(iInput = 0; (iInput < iMaxIn) && ((iPos + 3) < iInsertLen);
                iInput++)
            {
                for(iSlot = 0; (iSlot < CFG_BIND_SLOTS) &&
                               ((iPos + 3) < iInsertLen); iSlot++)
                {
                    uint8_t ta  = ConfigBindingGetTrigAct(iInput, iSlot);
                    uint8_t out = ConfigBindingGetOutput(iInput, iSlot);
                    uint16_t v  = 0;
                    if(((ta & 0x07u) != 0) && (out != BIND_OUTPUT_NONE))
                    {
                        v = (uint16_t)(((uint16_t)out << 5) | (ta & 0x1Fu));
                    }
                    pcInsert[iPos++] = pcHexB[(v >> 8) & 0xFu];
                    pcInsert[iPos++] = pcHexB[(v >> 4) & 0xFu];
                    pcInsert[iPos++] = pcHexB[v & 0xFu];
                }
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_FWVER:
        {
            //
            // Build timestamp formatted as YYYYMMDDHHMM from __DATE__ and
            // __TIME__ (both are compile-time string literals).
            //
            // __DATE__ = "Mon DD YYYY"  e.g. "Jul 11 2026"  (space-padded day)
            // __TIME__ = "HH:MM:SS"     e.g. "09:23:45"
            //
            static const char pcMons[] =
                "JanFebMarAprMayJunJulAugSepOctNovDec";
            const char *pd = g_pcBuildDate;
            const char *pt = g_pcBuildTime;
            int iMon, iDay, iYear, iHour, iMin;

            for(iMon = 0; iMon < 12; iMon++)
            {
                if((pd[0] == pcMons[iMon * 3]) &&
                   (pd[1] == pcMons[iMon * 3 + 1]) &&
                   (pd[2] == pcMons[iMon * 3 + 2]))
                {
                    break;
                }
            }
            iMon++;
            iDay  = ((pd[4] == ' ') ? 0 : (pd[4] - '0')) * 10 + (pd[5] - '0');
            iYear = (pd[7]-'0')*1000 + (pd[8]-'0')*100 +
                    (pd[9]-'0')*10   + (pd[10]-'0');
            iHour = (pt[0]-'0')*10 + (pt[1]-'0');
            iMin  = (pt[3]-'0')*10 + (pt[4]-'0');

            usnprintf(pcInsert, iInsertLen, "%04d%02d%02d%02d%02d",
                      iYear, iMon, iDay, iHour, iMin);
            break;
        }

        case SSI_INDEX_NTPTIME:
            SntpGetTimeStr(pcInsert, iInsertLen);
            break;

        case SSI_INDEX_NTPSVR:
            usnprintf(pcInsert, iInsertLen, "%s",
                      ConfigNtpGet()->pcServer);
            break;

        case SSI_INDEX_NTPTZ:
            usnprintf(pcInsert, iInsertLen, "%d",
                      (int)ConfigNtpGet()->i8TzOffset);
            break;

        case SSI_INDEX_MQPASS:
            usnprintf(pcInsert, iInsertLen, "%s", ConfigGet()->pcPass);
            break;

        case SSI_INDEX_INNAMES:
        case SSI_INDEX_OUTNAMES:
        {
            //
            // Emit one CFG_NAME_LEN (12) char block per channel, space-padded,
            // no NUL separators so JS can index by i*12.  Bounded by the names
            // record capacity (64) and by the SSI insert buffer
            // (LWIP_HTTPD_MAX_TAG_INSERT_LEN, 800 B = up to 66 blocks) via the
            // loop guard below.  Previously hard-capped at 16, so output/input
            // names past #16 never reached the browser.
            //
            bool bIn = (iIndex == SSI_INDEX_INNAMES);
            int iMax = bIn ? CFG_NAMES_MAX_INPUTS : CFG_NAMES_MAX_OUTPUTS;
            int iCount = bIn ? (int)ConfigGetDinDevices() * 8
                             : (int)ConfigGetRelayDevices() * 8;
            int i, j, iPos = 0;
            if(iCount > iMax) { iCount = iMax; }
            for(i = 0; i < iCount && (iPos + CFG_NAME_LEN) <= iInsertLen; i++)
            {
                const char *pcN = bIn ? ConfigGetInputName(i)
                                      : ConfigGetOutputName(i);
                for(j = 0; j < CFG_NAME_LEN; j++)
                {
                    pcInsert[iPos++] = (j < CFG_NAME_LEN - 1 && pcN[j])
                                       ? pcN[j] : ' ';
                }
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_INSTATES:
        case SSI_INDEX_OUTSTATES:
        {
            //
            // Emit one hex byte per configured device (8 inputs or relays
            // per byte).  Bit b of byte d = channel d*8+b is active/ON.
            //
            static const char pcH[] = "0123456789abcdef";
            bool bIn   = (iIndex == SSI_INDEX_INSTATES);
            int  nDev  = bIn ? (int)ConfigGetDinDevices()
                              : (int)ConfigGetRelayDevices();
            int  iPos = 0, d, b;
            if(nDev > 8) { nDev = 8; }  // cap: 8 devices = 64 channels
            for(d = 0; d < nDev && iPos + 2 <= iInsertLen; d++)
            {
                uint8_t ui8B = 0;
                for(b = 0; b < 8; b++)
                {
                    if(bIn)
                    {
                        if(g_pui8LiveInState[d] & (1u << b)) { ui8B |= (1u << b); }
                    }
                    else
                    {
                        if(RelayChainGet((uint16_t)(d * 8 + b))) { ui8B |= (1u << b); }
                    }
                }
                pcInsert[iPos++] = pcH[ui8B >> 4];
                pcInsert[iPos++] = pcH[ui8B & 0xFu];
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_OUTMODES:
        {
            //
            // One character per output: '1' = Timed, '0' = Standard (up to 16).
            //
            int n = (int)ConfigGetRelayDevices() * 8, i, iPos = 0;
            if(n > 16) { n = 16; }
            for(i = 0; (i < n) && ((iPos + 1) < iInsertLen); i++)
            {
                pcInsert[iPos++] = (ConfigOutMode(i) == OUT_MODE_TIMED) ? '1' : '0';
            }
            pcInsert[iPos] = '\0';
            break;
        }

