samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
        case SSI_INDEX_OUTTMO:
        {
            //
            // Comma-separated timed auto-OFF durations (ms), one per output.
            //
            int n = (int)ConfigGetRelayDevices() * 8, i, iPos = 0;
            if(n > 16) { n = 16; }
            for(i = 0; i < n; i++)
            {
                char tmp[12];
                int  L;
                usnprintf(tmp, sizeof(tmp), "%u", ConfigOutTimedMs(i));
                L = (int)strlen(tmp);
                if((iPos + L + 2) >= iInsertLen) { break; }
                if(i > 0) { pcInsert[iPos++] = ','; }
                memcpy(pcInsert + iPos, tmp, L);
                iPos += L;
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_SHUTTERS:
        {
            //
            // Configured shutters as "up:down:travel;" entries.
            //
            int i, iPos = 0;
            for(i = 0; i < CFG_MAX_SHUTTERS; i++)
            {
                uint8_t  up, down;
                uint32_t travel;
                char     tmp[24];
                int      L;
                if(!ConfigShutterGet(i, &up, &down, &travel)) { continue; }
                usnprintf(tmp, sizeof(tmp), "%d:%d:%u;", up, down, travel);
                L = (int)strlen(tmp);
                if((iPos + L) >= iInsertLen) { break; }
                memcpy(pcInsert + iPos, tmp, L);
                iPos += L;
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_SHNAMES:
        {
            //
            // One CFG_NAME_LEN (12) char space-padded block per DEFINED shutter,
            // in slot order - same skip condition and ordering as SSI_INDEX_SHUTTERS
            // so block n aligns with shutter entry n on the client.  Up to
            // 32 x 12 = 384 B, within the SSI insert buffer.
            //
            int i, j, iPos = 0;
            for(i = 0; i < CFG_MAX_SHUTTERS &&
                       (iPos + CFG_NAME_LEN) <= iInsertLen; i++)
            {
                uint8_t  up, down;
                uint32_t travel;
                const char *pcN;
                if(!ConfigShutterGet(i, &up, &down, &travel)) { continue; }
                pcN = ConfigShutterName(i);
                for(j = 0; j < CFG_NAME_LEN; j++)
                {
                    pcInsert[iPos++] = (j < CFG_NAME_LEN - 1 && pcN[j])
                                       ? pcN[j] : ' ';
                }
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_RMNAMES:
        {
            //
            // 12-char space-padded block for EVERY room (0..CFG_MAX_ROOMS-1) so
            // the client can index by room number.  16 x 12 = 192 B.
            //
            int i, j, iPos = 0;
            for(i = 0; i < CFG_MAX_ROOMS &&
                       (iPos + CFG_NAME_LEN) <= iInsertLen; i++)
            {
                const char *pcN = ConfigRoomName(i);
                for(j = 0; j < CFG_NAME_LEN; j++)
                {
                    pcInsert[iPos++] = (j < CFG_NAME_LEN - 1 && pcN[j])
                                       ? pcN[j] : ' ';
                }
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_OUTROOMS:
        {
            //
            // Comma-separated room index per output (ROOM_NONE = 255).
            //
            int i, iCount = (int)ConfigGetRelayDevices() * 8;
            int iPos = 0;
            char tmp[8];
            for(i = 0; i < iCount; i++)
            {
                int L;
                usnprintf(tmp, sizeof(tmp), (i == 0) ? "%d" : ",%d",
                          (int)ConfigOutRoom(i));
                L = (int)strlen(tmp);
                if((iPos + L) >= iInsertLen) { break; }
                memcpy(pcInsert + iPos, tmp, L);
                iPos += L;
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_SHROOMS:
        {
            //
            // Comma-separated room index per DEFINED shutter, slot order (same
            // skip as SSI_INDEX_SHUTTERS so entry n aligns with client SH[n]).
            //
            int i, iPos = 0, iEmit = 0;
            char tmp[8];
            for(i = 0; i < CFG_MAX_SHUTTERS; i++)
            {
                uint8_t  up, down;
                uint32_t travel;
                int      L;
                if(!ConfigShutterGet(i, &up, &down, &travel)) { continue; }
                usnprintf(tmp, sizeof(tmp), (iEmit == 0) ? "%d" : ",%d",
                          (int)ConfigShRoom(i));
                L = (int)strlen(tmp);
                if((iPos + L) >= iInsertLen) { break; }
                memcpy(pcInsert + iPos, tmp, L);
                iPos += L;
                iEmit++;
            }
            pcInsert[iPos] = '\0';
            break;
        }

        default:
            usnprintf(pcInsert, iInsertLen, "??");
            break;
    }

    //
    // Tell the server how many characters our insert string contains.
    //
    return(strlen(pcInsert));
}

//*****************************************************************************
//
// The interrupt handler for the SysTick interrupt.
//
//*****************************************************************************
void
SysTickIntHandler(void)
{
    //
    // Call the lwIP timer handler.
    //
    lwIPTimer(SYSTICKMS);

    //
    // Flag a periodic application tick for the main loop (MQTT keep-alive /
    // reconnect service).
    //
    g_bSysTickFlag = true;
}

//*****************************************************************************
//
// The interrupt handler for the timer used to pace the animation.
//
//*****************************************************************************
void
AnimTimerIntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    MAP_TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    //
    // Indicate that a timer interrupt has occurred.
    //
    HWREGBITW(&g_ulFlags, FLAG_TICK) = 1;
}

//*****************************************************************************
//
// Display an lwIP type IP Address.
//
//*****************************************************************************
void
DisplayIPAddress(uint32_t ui32Addr)
{
    char pcBuf[16];

    //
    // Convert the IP Address into a string.
    //
    usprintf(pcBuf, "%d.%d.%d.%d", ui32Addr & 0xff, (ui32Addr >> 8) & 0xff,
            (ui32Addr >> 16) & 0xff, (ui32Addr >> 24) & 0xff);

    //
    // Display the string.
    //
    UARTprintf(pcBuf);
}

//*****************************************************************************
//
// Gateway-reachability watchdog.
//
// The TivaWare port only (re)starts DHCP on an Ethernet *link* transition
// (lwIPLinkDetect).  When the board sits behind a switch, swapping the router
// leaves the board's link up, so no transition occurs and the board clings to
// its now-invalid lease until the DHCP timers eventually rebind -- which is why
// it took a reboot to get an address on the new network.
//
// This watchdog closes that gap.  While we hold a bound DHCP lease it ARPs the
// default gateway once per round; the ARP cache is flushed at the end of each
// round so a lingering stale entry cannot mask a dead gateway (a live gateway
// re-populates the entry before the next round).  If the gateway stays silent
// for GW_WD_MISS_LIMIT consecutive rounds the network almost certainly changed
// underneath us, so we drop the stale lease and start a fresh DHCP DISCOVER.
// If the gateway answers (same network) nothing happens.
//
// Runs from lwIPHostTimerHandler (100 ms, lwIP context under NO_SYS), so every
// lwIP call here shares the stack's own timer context.
//
//*****************************************************************************
#define GW_WD_ROUND_TICKS       150     // 150 x 100 ms = 15 s per probe round
#define GW_WD_MISS_LIMIT        3       // rediscover after ~3 silent rounds

static void
NetGatewayWatchdog(void)
{
    static uint32_t ui32Tick = 0;
    static uint32_t ui32Miss = 0;
    struct netif *psNetif;
    struct eth_addr *psEthRet;
    ip_addr_t *psIpRet;

    //
    // One probe round every GW_WD_ROUND_TICKS host-timer calls.
    //
    if(++ui32Tick < GW_WD_ROUND_TICKS)
    {
        return;
    }
    ui32Tick = 0;

    //
    // Only act on a genuinely bound DHCP lease that has a gateway.  While an
    // address is still being acquired the link/DHCP path is in charge.
    //
    psNetif = netif_default;
    if((psNetif == NULL) || (psNetif->dhcp == NULL) ||
       (psNetif->dhcp->state != DHCP_BOUND) || (psNetif->gw.addr == 0))
    {
        ui32Miss = 0;
        return;
    }

    //
    // Evaluate this round's probe: a stable ARP entry for the gateway means it
    // answered (the cache was flushed after the previous request, so a hit is
    // necessarily fresh).
    //
    if(etharp_find_addr(psNetif, &psNetif->gw, &psEthRet, &psIpRet) >= 0)
    {
        ui32Miss = 0;
    }
    else
    {
        ui32Miss++;
        UARTprintf("GW watchdog: gateway silent (%u/%u)\n", ui32Miss,
                   (uint32_t)GW_WD_MISS_LIMIT);
        if(ui32Miss >= GW_WD_MISS_LIMIT)
        {
            //
            // The network changed under us -- release the stale lease and kick
            // off a fresh DHCP DISCOVER to get a valid address.
            //
            ui32Miss = 0;
            UARTprintf("GW watchdog: gateway unreachable, restarting DHCP.\n");
            dhcp_release(psNetif);
            dhcp_start(psNetif);
            return;
        }
    }

    //
    // Arm the next round: flush the ARP cache (so a stale gateway entry can't
    // hide a later failure), then ARP the gateway.  A live gateway replies well
    // before the next round; a dead one leaves the entry empty.
    //
    etharp_cleanup_netif(psNetif);
    etharp_request(psNetif, &psNetif->gw);
}

//*****************************************************************************
//
// Required by lwIP library to support any host-related timer functions.
//
//*****************************************************************************
void
lwIPHostTimerHandler(void)
{
    uint32_t ui32NewIPAddress;

    //
    // Get the current IP address.
    //
    ui32NewIPAddress = lwIPLocalIPAddrGet();

    //
    // See if the IP address has changed.
    //
    if(ui32NewIPAddress != g_ui32IPAddress)
    {
        //
        // See if there is an IP address assigned.
        //
        if(ui32NewIPAddress == 0xffffffff)
        {
            //
            // Indicate that there is no link.
            //
            UARTprintf("Waiting for link.\n");
        }
        else if(ui32NewIPAddress == 0)
        {
            //
            // There is no IP address, so indicate that the DHCP process is
            // running.
            //
            UARTprintf("Waiting for IP address.\n");
        }
        else
        {
            //
            // Display the new IP address.
            //
            UARTprintf("IP Address: ");
            DisplayIPAddress(ui32NewIPAddress);
            UARTprintf("\n");
            UARTprintf("Open a browser and enter the IP address.\n");

            //
            // We now have network connectivity: ask the main loop to bring up
            // the MQTT connection (if a broker has been configured).
            //
            g_bStartMQTT = true;
            SntpInit();
        }

        //
        // Save the new IP address.
        //
        g_ui32IPAddress = ui32NewIPAddress;
    }

    //
    // If there is not an IP address.
    //
    if((ui32NewIPAddress == 0) || (ui32NewIPAddress == 0xffffffff))
    {
        //
        // Do nothing and keep waiting.
        //
    }

    //
    // Recover a lost DHCP lease when the network changes without an Ethernet
    // link transition (e.g. router swapped while behind a switch).
    //
    NetGatewayWatchdog();
}

//*****************************************************************************
//
// Apply all binding slots for one input that match the given trigger event.
// Each matching slot sets a relay and publishes its new retained state.
//
//*****************************************************************************
static void
ApplyBindings(int iInput, uint8_t ui8Trig)
{
    int iSlot;

